Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: གོས་འདོད་པ་ལ་ནི་གོས་སྦྱིན་པར་བྱེད།
en: To those who wished for clothes he gave clothes.

source: རྒྱན་འདོད་པ་ལ་ནི་རྒྱན་སྦྱིན་པར་བྱེད།
en: To those who wished for adornments he gave adornments.

source: བཞོན་པ་འདོད་པ་ལ་ནི་བཞོན་པ་སྦྱིན་པར་བྱེད།
en: To those who wished for mounts he gave mounts.

source: ཡོ་བྱད་གཞན་འདོད་པ་ལ་ནི་ཡོ་བྱད་གཞན་སྦྱིན་པར་བྱེད་ཅིང་ནད་པ་གསོ་བའི་ནད་བྲང་བཅས་ཏེ་ཡོ་བྱད་ཐམས་ཅད་སྦྱར་ནས།
en: To those who wished for other goods he gave other goods, and for the sick and for homes for the sick he provided everything that they needed,

source: སྨན་པ་རྣམས་དང་། ནད་གཡོག་རྣམས་བསྐོས་ཏེ།
en: appointing healers and attendants.

source: ནད་པ་རྣམས་དང་། མགོན་མེད་པ་རྣམས་ཀྱི་རིམ་གྲོ་བྱེད་དོ། །
en: “He served the orphaned.

source: བཟའ་བ་དང་བཅའ་བ་མང་པོ་དག་ཀྱང་སྟ་གོན་བྱས་ཏེ།
en: He prepared a great deal of food and drink

source: ནམ་མཁའ་ལ་གནས་པ་དང་། ཆུ་ན་གནས་པ་དང་། ཐང་ལ་གནས་པའི་སྲོག་ཆགས་རྣམས་ལ་སྦྱིན་པར་བྱེད་དོ། །
en: and made gifts of it to the creatures that flew through the sky, dwelt in the water, or made their homes in the fields.

source: འཇིག་རྟེན་དག་ཀྱང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་འགོད་པར་བྱེད་དེ།
en: He set the worldly on the path of the ten virtuous actions,

source: དེར་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་བླངས་པའི་རྒྱུས་སེམས་ཅན་ཕལ་ཆེར་ལྷའི་ནང་དུ་སྐྱེས་སོ། །
en: and thereafter, their embrace of the path of the ten virtuous actions was cause for the greater part of those beings to take birth among the gods,

source: དེ་དག་དེར་སྐྱེས་པས་ལྷའི་གནས་རྣམས་གང་བར་གྱུར་ཏོ། །
en: until they began to fill all the gods’ residences.

source: རྒྱུ་གཉིས་ཀྱིས་ན་ལྷའི་གནས་རྣམས་གང་བར་འགྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་འབྱུང་བ་དང་། འཁོར་ལོས་སྒྱུར་བ་འབྱུང་བ་འདི་གཉིས་ཡིན་ན།
en: ‘There are only two reasons for all the gods’ residences to fill up—the appearance of the Tathāgata, or the appearance of a universal monarch.

source: ཅི་ད་ལྟར་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་དུ་བྱུང་ངམ། འོན་ཏེ་འཁོར་ལོས་སྒྱུར་བ་འཇིག་རྟེན་དུ་བྱུང་ཞིག་གུ་སྙམ་མོ། །
en: Has the Tathāgata appeared in the world, or has a universal monarch appeared in the world?’

source: དེ་ནས་དེས་བལྟས་ན་དེ་བཞིན་གཤེགས་པ་ཡང་འཇིག་རྟེན་དུ་མ་བྱུང་། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཡང་འཇིག་རྟེན་དུ་མ་བྱུང་ངོ་། །
en: But when he looked, he saw that neither had the Tathāgata appeared in the world, nor had a universal monarch appeared.

source: འོ་ན་སུའི་མཐུས་ལྷའི་གནས་གང་བར་གྱུར་སྙམ་སྟེ།
en: ‘Well then, because of whom have the gods’ residences become full?’ he wondered.

source: དེས་བལྟས་ན་རྒྱལ་པོ་རྣམ་པར་རྒྱལ་བའི་མཐུས་དེ་ལྟར་གྱུར་པར་མཐོང་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བསམས་པ།
en: “Śakra, King of the Gods, looked, and saw that it was because of King Vijaya.

source: འདི་ཅི་ཞིག་སྒྲུབ་ཅིང་འདུག་སྙམ་སྟེ།
en: He thought, ‘What is he trying to do there?’

source: དེས་བལྟས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་སྒྲུབ་པར་མཐོང་ངོ་། །
en: and when he looked again he saw that he was practicing to attain unexcelled, total, and complete enlightenment.

source: རེ་ཞིག་འདི་སེམས་ཅན་བརྟན་པོ་ཡིན་ནམ། འོན་ཏེ་སེམས་ཅན་མི་བརྟན་པ་ཡིན་པ་དེ་བརྟགས་ལ་གལ་ཏེ་
en: ‘I will go for a time and see for myself whether he is of firm resolve.

source: སེམས་ཅན་བརྟན་པོ་ཞིག་ཡིན་ན་ནི་འདི་ལ་མཆོད་པ་བྱའོ། །
en: If this being’s resolve is firm, I shall worship him.

source: དེ་སྟེ་སེམས་ཅན་མི་བརྟན་པ་ཞིག་ཡིན་ན་ནི་འདི་བརྟན་པོར་འགྱུར་བར་བྱའོ་སྙམ་དུ་བསམས་ནས་
en: If this being’s resolve is not firm, I shall steady him.’

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ཡུལ་དེར་སེམས་ཅན་མང་པོ་སྤྲུལ་ནས་སྤྲུལ་པ་དེ་དག་གིས་བློན་པོ་དེ་དག་ལ་སྨྲས་པ།
en: With this in mind, Śakra, King of the Gods, emanated himself in the region as a variety of beings, and the emanations said to the ministers,

source: གལ་ཏེ་རྒྱལ་པོ་འདིས་བདག་ཅག་ཟས་དང་སྐོམ་གྱིས་ཚིམ་པར་བྱེད་ན་ནི་དེའི་འོག་ཏུ་བདག་ཅག་གིས་ཀྱང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་བླངས་ཏེ་ གནས་པར་བྱའོ། །
en: ‘If the king satisfies us with food and drink, afterward we too will adopt the path of the ten virtuous actions and abide by it.’

source: དེ་ནས་བློན་པོ་རྣམས་ཀྱིས་རྒྱལ་པོ་རྣམ་པར་རྒྱལ་བ་ལ་གསོལ་ཏོ། །
en: “The ministers made the request of King Vijaya,

source: དེ་ནས་རྒྱལ་པོ་རྣམ་པར་རྒྱལ་བས་སྤྲུལ་པ་དེ་དག་བཀུག་སྟེ་བསྒོ་བ་ངས་ཁྱེད་ཟས་དང་སྐོམ་གྱིས་ཚིམ་པར་བྱའོ། །
en: and King Vijaya summoned the emanations and told them, ‘I shall satisfy you with food and drink.’

source: སྤྲུལ་པ་རྣམས་ཀྱིས་སྨྲས་པ། ལྷ་ཁྱོད་ཀྱིས་བདག་ཅག་ཟས་དང་སྐོམ་གྱིས་ཚིམ་པར་བྱེད་མི་ནུས་ཏེ། བདག་ཅག་ནི་གསར་དུ་བསད་པའི་མི་ཤ་ནི་ཟ། མི་ཁྲག་ནི་འཐུང་ངོ་། །
en: The emanations replied, ‘Deva, you will not be able to satisfy us with food and drink, for we eat the flesh of humans freshly killed, and drink their blood.’

source: དེ་ནས་རྒྱལ་པོས་བསམས་པ། འདི་དག་ནི་མི་མ་ཡིན་ཏེ།
en: “The king thought, ‘These are nonhuman spirits!

source: འདི་དག་ནི་མི་མ་ཡིན་པ་ཡིན་ལ། ཤ་དང་ཁྲག་འདི་ལྟ་བུ་ནི་མ་བསད་ཀྱི་བར་དུ་མི་རྙེད་དོ། །
en: Flesh and blood like that can’t be had without killing someone.

source: འོན་ཀྱང་གལ་ཏེ་འདི་རྣམས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་བླངས་ཏེ་གནས་པར་གྱུར་ན།
en: Well then, if they are going to adopt the path of the ten virtuous actions and abide by it,

source: བདག་གི་ཤ་དང་ཁྲག་གིས་ཚིམ་པར་བྱའོ་སྙམ་དུ་བསམས་ནས་
en: I will satisfy them with my own flesh and blood.’

source: བྱང་ཆུབ་སེམས་དཔའ་དེས་སྤྲུལ་པ་རྣམས་ལ་སྨྲས་པ།
en: “The Bodhisattva said to the emanations,

source: གལ་ཏེ་ཁྱེད་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་བླངས་ཏེ་ གནས་པར་བྱེད་ན་
en: ‘If you completely adopt the path of the ten virtuous actions and abide by it,

source: ངས་ང་རང་གི་ཤ་དང་ཁྲག་གིས་ཚིམ་པར་བྱའོ། །
en: I shall satisfy you with my own flesh and blood.’

source: སྤྲུལ་པ་རྣམས་ཀྱིས་སྨྲས་པ། ཁྱོད་ཇི་ལྟར་བཞེད་པ་བཞིན་དུ་བགྱིའོ། །
en: “ ‘As you wish,’ replied the emanations.

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་བྱང་ཆུབ་སེམས་དཔས་ལུས་ཐོག་ཐག་ནས་ཤ་རྣམས་བཅད་དེ་དེ་དག་ལ་བྱིན་ནས་
en: “The Bodhisattva immediately began carving the flesh out from all over his body and handing it to them,

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་པ།
en: all the while praying for unexcelled, total, and complete enlightenment, saying,

source: ཀྱེ་མ་དགེ་བའི་རྩ་བ་འདིས་བདག་འཇིག་རྟེན་ལོང་བ། འདྲེན་པ་མེད་པ། སྟོན་པ་མེད་པར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ།
en: ‘By this root of virtue, may I become a protector for the world’s blind who are without a guide, without any guide at all, without anyone to show them the way—an arhat, a totally and completely awakened buddha endowed with perfect knowledge and perfect conduct,

source: བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུ་གྱུར་ཅིག་ཅེས་
en: a sugata, a knower of the world, a tamer of persons, a charioteer, an unsurpassed one, a teacher of humans and gods—a Blessed Buddha.’

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་ནས་སྤྲུལ་པ་དེ་དག་ཐམས་ཅད་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་བཀོད་དོ། །
en: “After praying for unexcelled, total, and complete enlightenment, he set the emanations on the path of the ten virtuous actions.

source: བྱང་ཆུབ་སེམས་དཔའ་འདིས་ནི་མཆོག་ཏུ་དཀའ་བ་བྱས་མོད་ཀྱི།
en: ‘Though this bodhisattva has performed an extraordinary austerity,

source: འོན་ཀྱང་བདག་གིས་འདིའི་ལུས་སྔ་མཁོ་བཞིན་དུ་འགྱུར་བར་བྱེད་མ་ནུས་སོ། །
en: I cannot restore his body.

source: གཞན་ཡང་འདིའི་སྤྲོ་བ་བསྐྱེད་དགོས་སོ་སྙམ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་སྨྲས་པ།
en: Still, I must spur him on.’ With this thought, he said to the Bodhisattva,

source: གྲོགས་པོ་དག་ཁྱོད་ཤ་རྣམས་གཅོད་པ་དང་། ཆུ་བ་དང་རྩ་བྲང་བྲེང་རྣམས་གཅོད་པ་དང་། ཅུང་ཟད་ཙམ་ཡང་སེམས་མི་དགའ་བ་ལྟ་ཡོད་དམ།
en: ‘My friend, are you not even a little unhappy to cut away your flesh and sever your sinews and veins?’

source: ཀྱེ་ང་ནི་ཤ་རྣམས་གཅོད་པ་དང་། ཆུ་བ་དང་རྩ་བྲང་བྲེང་རྣམས་གཅོད་པ་ན་ཅུང་ཟད་ཀྱང་སེམས་མི་དགའ་བ་མེད་དེ་
en: ‘Oh, I’m not the least bit unhappy to cut away my flesh or to sever my sinews and veins.

source: བདག་ཉིད་ཕོངས་པ་མཐོང་ན་ལྷག་པར་ཡང་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོ་དང་། ཡི་དགས་སུ་སྐྱེ་བའི་སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་སྐྱེས་སོ། །
en: As I witness my own distress, I feel especially strong compassion for beings born as hell beings, animals, or anguished spirits.’

source: བརྒྱ་བྱིན་གྱིས་སྨྲས་པ། གྲོགས་པོ་ཁྱོད་ཇི་ལྟར་ཡིད་ཆེས་པར་རུང་།
en: “ ‘How could I possibly believe you, my friend?’ asked Śakra.

source: བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། ངས་གྲོགས་པོ་ཁྱེད་བདེན་པ་བསྐུལ་བས་རངས་པར་བྱའོ་ཞེས་བྱས་ནས་
en: “ ‘You will rejoice at my invocation of the truth,’ the Bodhisattva said.

source: བྱང་ཆུབ་སེམས་དཔས་བདེན་པ་བསྐུལ་བ་བྱས་ཏེ།
en: With that the Bodhisattva began to invoke the truth, saying,

source: བདེན་པ་དང་བདེན་པའི་ཚིག་གང་གིས་ཇི་ལྟར་བདག་གི་ཤ་རྣམས་གཅོད་པ་དང་། ཆུ་བ་དང་། རྩ་བྲང་བྲེང་རྣམས་གཅོད་པ་ན་ཅུང་ཟད་ཀྱང་སེམས་མི་དགའ་བ་མེད་ནབདེན་པ་དང་བདེན་པའི་ཚིག་དེས་བདག་གི་ལུས་འདི་སྔ་མཁོ་བཞིན་དུ་གྱུར་ཅིག་ཅེས་བྱས་ནས།
en: ‘If it is true that I’m not the least bit unhappy to cut away my flesh and to sever my sinews and veins, then by these words of truth may my body be restored.’

source: དེ་སྐད་བརྗོད་མ་ཐག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་ལུས་དེ་སྔ་མཁོ་བཞིན་དུ་གྱུར་ཏོ། །
en: No sooner had the Bodhisattva said this than his body was restored.

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་རང་བཞིན་གྱི་གཟུགས་སུ་བསྒྱུར་ཏེ་རྐང་པ་ལ་ཕྱག་འཚལ་ནས་བཟོད་པར་གསོལ་ཏེ།
en: “Śakra, King of the Gods, assumed his natural form, bowed down at the feet of the Bodhisattva, and asked his forgiveness.

source: གྲོགས་པོ་ཁྱོད་ལ་ངས་གཙེ་བའི་བསམ་པས་གནོད་པ་བྱས་པ་བཟོད་པར་མཛོད་ཅིག །
en: ‘My friend,’ he said, ‘forgive me for harming you with such ill intent,

source: དེ་ལྟ་མོད་ཀྱི་ཁྱོད་ཉིད་སྤྲོ་བ་བསྐྱེད་པའི་ཕྱིར་ཁྱོད་ལ་གནོད་པ་བྱས་པར་ཟད་དོ་ཞེས་སྨྲས་ནས་
en: for though I had intended this to spur you on, in the end I only hurt you.’

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ཏོ། །
en: With that, Śakra, King of the Gods, disappeared on the spot.

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་གནས་པ་གང་ཡིན་པ་དེ་ནི་ང་ཉིད་ཡིན་ཏེ།
en: I was the one who was that bodhisattva then, and lived the life of a bodhisattva.

source: དེའི་ཚེ་ན་ཡང་ང་འདུལ་བའི་དབང་གིས་སྡུག་བསྔལ་བར་གྱུར་ཏོ། །
en: There as well, amid the pain of dying I took on great difficulties for the sake of taming someone.”

source: ཡོན་རབས་ཞེས་བྱ་བ་ནི།
en: The Worthy of Offerings Litany

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན་ཁྱིམ་བདག་ཅིག་གནས་པ་དེས་ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མ་བླངས་ཏེ། དེ་དེ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་དོ། །
en: When the Blessed One was in Śrāvastī there lived a certain householder. When the time came for him to marry, he took a wife and they enjoyed themselves and coupled.

source: ཕྱི་ཞིག་ན་དེས་སངས་རྒྱས་ལ་དད་པ་དང་། ཆོས་ལ་དད་པ་དང་། དགེ་འདུན་ལ་དད་པར་གྱུར་ནས་སྐྱབས་སུ་འགྲོ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་བླངས་ཏེ་སྦྱིན་པ་དག་བྱིན་ཞིང་བསོད་ནམས་དག་བྱེད་པ་ལ་ཞུགས་སོ། །
en: In time he found faith in the Buddha, faith in the Dharma, and faith in the Saṅgha, went for refuge, took the fundamental precepts, and began to give gifts and make merit.

source: དེའི་ཁྱིམ་དེ་ཁྲོན་པ་དང་འདྲ་བར་གྱུར་ཏེ།
en: The householder became like an open well,

source: ཉིན་གཅིག་བཞིན་དུ་དེའི་ཁྱིམ་དུ་དགེ་འདུན་གྱི་ཕྱིར་བསྐོས་པའི་དགེ་སློང་རྣམས་ཟན་ཟའོ། །
en: and the monks who were assigned to his house on behalf of the saṅgha took their food there every day.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཁྱིམ་བདག་དེས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་སྤྱན་དྲངས་ཏེ།
en: One day the householder extended an invitation to the Buddha and the rest of the saṅgha of monks

source: དེས་དེ་དག་ལ་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོས་ཚིམ་པར་བྱས་ཏེ་ཅི་བཞེད་པ་བསྟབས་ནས།
en: and contented them with many good, wholesome foods, proffering all that they wished.

source: བཅོམ་ལྡན་འདས་བཤོས་གསོལ་ཟིན་ཏེ། བསྩང་སྡེར་ནི་གྱུ། ཕྱག་ནི་བཅབས་པར་རིག་ནས་སྟན་ཆེས་དམའ་བ་ཞིག་བླངས་ཏེ་ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ། །
en: Once he knew that the Blessed One had finished eating and that his bowl had been taken away and his hands washed, the householder brought in a very low seat and sat before the Blessed One to listen to the Dharma.

source: དེས་ན་ཁྱིམ་བདག་དེས་སྟན་དེ་ཉིད་ལ་འདུག་བཞིན་དུ་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ
en: When he heard it, the householder destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where he sat.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་དགའ་བར་མཛད་ནས་གདན་ལས་བཞེངས་ཏེ་གཤེགས་སོ། །
en: After the Blessed One had instructed, encouraged, inspired, and delighted him with a discourse on the Dharma he rose from his seat and departed.

source: དེ་ནས་ཕྱི་ཞིག་ན་དགེ་སློང་གསར་དུ་དགྲ་བཅོམ་པ་ཞིག་ཁྱིམ་དེར་དགེ་འདུན་གྱི་ཕྱིར་བསྐོས་པའི་མཆོད་སྟོན་གྱི་རེས་ལ་བབ་སྟེ་འོངས་སོ། །
en: One day it was the turn of a monk who had newly become an arhat to take his meal there on behalf of the assembly.

source: དེ་ཕྱི་བཞིན་དུ་གཙུག་ལག་ཁང་གི་སྣ་ལ་གཏོགས་པའི་ཕྱིར་མི་འོང་བ་ཞིག་ཀྱང་འོངས་སོ། །
en: He came accompanied by a non-returner affiliated with the monastery.

source: དེ་ནས་ཁྱིམ་བདག་དེས་དེ་གཉིས་ལ་ཟན་སྦྱིན་པར་བྱས་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་བསམས་པ།
en: After the householder had provided food for both of them, Venerable Śāriputra thought,

source: དགེ་སློང་དེས་ནི་ཁྱིམ་བདག་དེ་ལ་ཡོན་གྱི་རབས་གདོན་པར་མི་ནུས་སོ་སྙམ་ནས་
en: “That monk doesn’t know how to recite the Worthy of Offerings litany for the householder.”

source: ཁྱིམ་དེའི་ནང་དུ་སོང་སྟེ་སྟན་བཤམས་པ་ལ་འདུག་ནསདགེ་སློང་དེས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་གསོལ་བ་བཏབ་སྟེ། གནས་བརྟན་ཡོན་གྱི་རབས་གདོན་པར་གསོལ་ཞེས་བྱས་སོ། །
en: So Venerable Śāriputra went to the house himself and sat down upon the seat that had been prepared. The monks said to him, “Elder brother, we request that you please chant the Worthy of Offerings litany.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ཁྱིམ་དེར་ཡོན་གནས་ཚོགས་པ་མཐོང་ནས། དེ་ཁོ་ན་དང་འཐུན་པའི་ཡོན་གྱི་རབས་བཏོན་ནས་
en: Venerable Śāriputra observed that the assembly was indeed worthy of offerings, so he recited the Worthy of Offerings litany accordingly and said,

source: བདག་གིས་ནི་སྦྱིན་པའི་འབྲས་བུའི་ཚད་རྒྱས་པར་བརྗོད་པར་མི་ནུས་སོ། །
en: “I myself cannot tell you the karmic ripening of the fruits of each portion given.

source: བཅོམ་ལྡན་འདས་ནི་ཐམས་ཅད་གཟིགས་པ་ཡིན་པས་འབྲས་བུ་དང་རྣམ་པར་སྨིན་པ་མཁྱེན་ཏོ་ཞེས་སྨྲས་ཏེ།
en: The Blessed One is omniscient. He understands an action’s ripening and result.”

source: དེས་ཡོན་གྱི་རབས་བཏོན་ནས་ཁྱིམ་བདག་དེའི་ཆུང་མ་ལ་ཡང་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: After he recited the Worthy of Offerings litany, he also taught the householder and his wife the Dharma particularly suited to them,

source: དེས་ན་ཁྱིམ་བདག་དེ་དང་ཆུང་མས་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ནས་
en: such that the householder and his wife manifested the resultant state of non-return.

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་དགའ་བར་བྱས་ནས་སྟན་ལས་ལངས་ཏེ་སོང་ངོ་། །
en: After Venerable Śāriputra had instructed, encouraged, inspired, and delighted them with a discourse on the Dharma, he rose from his seat and departed.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཁྱིམ་བདག་དེའི་བློ་སྐྱེས་པ་བདག་ཁྱིམ་ན་གནས་པས་ཆོག་གིས།
en: One day the householder thought, “I have had enough of living at home.

source: བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་འབྱུང་ངོ་སྙམ་ནས་
en: I will go forth in the doctrine of the Blessed One.”

source: བཟའ་བྲན་གཉི་གས་སྦྱིན་པ་དག་བྱིན་ཞིང་བསོད་ནམས་དག་བྱས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ངོ་། །
en: Both spouses gave gifts and made merit, and went forth in the doctrine of the Blessed One.

source: རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ནས་
en: Once gone forth, they cast away all afflictive emotions and manifested arhatship.

source: དེ་དགྲ་བཅོམ་པ་ཁམས་གསུམ་པའི་འདོད་ཆགས་དང་བྲལ་བར་གྱུར་ཏེ། གསེར་དང་བོང་བར་མཉམ་པ། ནམ་མཁའ་དང་ལག་མཐིལ་དུ་འདྲ་བའི་སེམས་དང་ལྡན་པ།
en: As arhats, free from the attachments of the three realms, their minds regarded gold no differently than filth, and the palms of their hands as like space itself.

source: བཙུན་པ་འདི་བཟའ་བྲན་གཉིས་ཀྱིས་སྔོན་ལས་ཅི་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ཏེ
en: “what action did this married couple take that ripened into their births into families of great means, prosperity, and wealth;

source: འདི་གཉིས་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱང་མཉེས་པར་བགྱིས་ཏེ་མི་མཉེས་པར་མ་བགྱིས་ལ་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་ལགས།
en: that they pleased the Blessed One, and did not displease him; that they went forth in the doctrine of the Blessed One, cast away all afflictive emotions, and manifested arhatship?”

source: གསོལ་པ། བཙུན་པ་འདི་གཉིས་ཀྱིས་སྨོན་ལམ་གང་དུ་བཏབ་ལགས།
en: “Lord, where did they make these prayers?”

source: བཀའ་སྩལ་པ། དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: “Monks,” the Blessed One recounted, “in times past, in this fortunate eon, when people lived as long as twenty thousand years, and the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world,

source: དེའི་གསུང་རབ་ལ་འདི་གཉིས་རབ་ཏུ་བྱུང་ནས་དེར་འདི་གཉིས་ཀྱིས་སྦྱིན་པ་དག་སྦྱིན་ཞིང་བསོད་ནམས་དག་བྱས་ཏེ། ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས་
en: they went forth in his teaching. “They gave gifts, made merit, and practiced pure conduct all their lives.

source: ཀྱེ་མ་དགེ་བའི་རྩ་བ་འདིས་བདག་ཅག་གཉིས་གང་དང་གང་དུ་སྐྱེ་བར་འགྱུར་བ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེ་བར་ཤོག་ཤིག །
en: ‘By this root of virtue, wherever we are born, may it be into families of great means, prosperity, and wealth.

source: དེའི་ཚེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གསུང་རབ་ལ་རབ་ཏུ་བྱུང་བའི་བཟའ་བྲན་དེ་གཉིས་ནི་རབ་ཏུ་བྱུང་བ་འདི་གཉིས་ཁོ་ན་ཡིན་ཏེ
en: Those who were the two married persons then and went forth in the teaching of Buddha Kāśyapa are none other than these two married persons who have gone forth now.

source: དེ་གཉིས་ཀྱིས་དེར་རབ་ཏུ་བྱུང་ནས་སྦྱིན་པ་དག་སྦྱིན་ཞིང་བསོད་ནམས་དག་བྱས་ཏེ། ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་བསྲུངས་ནས་འཆི་ཀར་སྨོན་ལམ་བཏབ་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ཏེ
en: The acts of going forth, giving gifts and making merit, practicing pure conduct all their lives, and saying that prayer at the time of their deaths ripened such that wherever they were born, it was into families of great means, prosperity, and wealth,

source: འདི་གཉིས་ཀྱིས་ང་མཉེས་པར་བྱས་ཏེ་མི་མཉེས་པར་མ་བྱས་ལ།
en: and that they pleased me and did not displease me,

source: རྒན་ཞུགས་གཉིས་ཞེས་བྱ་བ་དེ་ལ། རྒན་ཞུགས་དང་པོ་ནི།
en: Latecomers to the Dharma: Two Stories The First “Latecomer” Story

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེ་ན་གང་གི་ཚེ་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་གྱིས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་གཙུག་ལག་ཁང་རྣམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་དུ་བཅུག་ནས་
en: When the Blessed One was in the garden of Prince Jeta in Śrāvastī, Anāthapiṇḍada commissioned the construction of a monastery complete in every respect.

source: སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་ཕུལ་ཏེསྦྱིན་པ་དག་སྦྱིན་ཞིང་བསོད་ནམས་དག་བྱེད་པ་ལ་ཞུགས་པ་
en: He offered it to the Blessed One and the rest of saṅgha of monks, and began to give gifts and make merit.

source: དེའི་ཚེ་མཉན་དུ་ཡོད་པ་དེ་ཉིད་ན་ཁྱིམ་བདག་གཞན་ཞིག་གནས་པ་དེས་བསམས་པ།
en: At that time there was another householder in Śrāvastī who thought,

source: བདག་གིས་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་འདི་སྦྱིན་པ་གཏོང་བས་ཟིལ་གྱིས་ནོན་པར་འགྱུར་བའི་ཐབས་ལྟ་ཅི་ཡོད་སྙམ་མོ། །
en: “How can I outshine the householder Anāthapiṇḍada in gift giving?”

source: མ་ལ་བདག་གིས་རྒྱ་མཚོའི་ནང་དུ་འགྲོ་བའི་དོན་བསྒྲུབས་ལ། གལ་ཏེ་བདག་གིས་དེར་རྒྱ་མཚོའི་གྲུ་བོ་ཆེའི་དོན་གྲུབ་པར་གྱུར་ཏེ་
en: “Aha! If I venture out onto the great ocean to Ratnadvīpa and complete my voyage,

source: ཕྱིར་འོངས་ན་ནི་དེ་ལྟ་ན་བདག་གིས་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་སྦྱིན་པ་གཏོང་བས་ཟིལ་གྱིས་གནོན་པར་ནུས་སོ་སྙམ་མོ། །
en: upon my return I shall be able to outshine the householder Anāthapiṇḍada’s gift giving.”

source: དེ་ནས་དེ་རྒྱ་མཚོ་ཆེན་པོའི་ནང་དུ་ཞུགས་ནས་རིན་པོ་ཆེའི་གླིང་དུ་འགྲོ་བ་བསྒྲུབས་ཏེ་རྒྱ་མཚོའི་གྲུ་བོ་ཆེའི་དོན་གྲུབ་ནས་མཉན་དུ་ཡོད་པར་ཕྱིན་ཏོ། །
en: So he ventured out onto the great ocean to Ratnadvīpa, completed his voyage, and returned to Śrāvastī.

source: དེ་དེར་འོངས་ནས་སྦྱིན་པ་དག་སྦྱིན་ཞིང་བསོད་ནམས་དག་བྱེད་པ་ལ་ཞུགས་ནས།
en: Upon his return he began to give gifts and make merit,

source: འོན་ཀྱང་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་ཟིལ་གྱིས་མནན་པར་མ་ནུས་སོ། །
en: but he was still unable to outshine the householder Anāthapiṇḍada.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཁྱིམ་བདག་དེས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་དྲིས་པ།
en: One day the householder asked Venerable Śāriputra,

source: བཙུན་པ་ཤཱ་རིའི་བུ་ཐབས་ཅི་ཞིག་གིས་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་དགེ་བ་བགྱིས་པས་ཟིལ་གྱིས་གནོན་པར་ནུས།
en: “Lord Śāriputra, by what means can my virtue outshine Anāthapiṇḍada’s gift giving?”

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་སྨྲས་པ། ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་ནི་བསོད་ནམས་ཅན་ཆེ་བར་གྲགས་པ་ཡིན་ཏེ།
en: “Householder, Anāthapiṇḍada’s merit is of great renown,” Venerable Śāriputra told him.

source: དེས་ནི་གཏེར་བདག་པོ་ཡོད་པ་དང་། བདག་པོ་མེད་པ་དང་། ཆུ་ན་ཡོད་པ་དང་། སྐམ་ལ་ཡོད་པ་དང་། རིང་བ་དང་། ཉེ་བ་རྣམས་ཀྱང་མཐོང་བས་ན་
en: “He can see treasures, whether they belong to someone or to no one, or whether they are in the water or on dry land, near or far.

source: དེ་ནི་ཁྱོད་ཀྱིས་སྦྱིན་པ་བཏང་བས་ཟིལ་གྱིས་གནོན་པར་མི་ནུས་ཏེ
en: That’s why you can’t outshine him in giving.

source: བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ན་དེ་འབའ་ཞིག་གིས་ཁྱོད་ཀྱིས་ཟིལ་གྱིས་མནན་པར་ནུས་སོ། །
en: You could only outshine him by going forth in the doctrine of the Blessed One.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་ཁྱིམ་བདག་དེས་སྦྱིན་པ་དག་སྦྱིན་ཞིང་བསོད་ནམས་དག་བྱས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ངོ་། །
en: No sooner had the householder heard this than he gave gifts, made merit, and went forth in the doctrine of the Blessed One.

source: དེ་རབ་ཏུ་བྱུང་སྟེ། བརྩོན་པ་དང་། བསྒྲུབ་པ་དང་། འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ཏེ།
en: Having gone forth, he cast away all afflictive emotions with diligence, practice, and effort, and manifested arhatship.

source: སྲིད་པའི་རྙེད་པ་དང་ཆགས་པ་དང་། བཀུར་སྟི་ལ་མི་ལྟ་བ།
en: He had no regard for worldly profit, passion, or acclaim.

source: དེ་ནས་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་གྱིས་ཁྱིམ་བདག་ཆེ་གེ་མོ་ཞིག་གིས་ཁྱོད་ཟིལ་གྱིས་མནན་པར་བྱ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ངོ་། །
en: The householder Anāthapiṇḍada heard that such-and-such a householder had gone forth in the doctrine of the Buddha to outshine him,

source: དེ་ལྟར་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ་ཞེས་ཐོས་སོ། །
en: and that after going forth he had cast away all afflictive emotions and manifested arhatship.

source: དེ་ཐོས་མ་ཐག་ཏུ་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་དགའ་བར་གྱུར་ཏེ།
en: When he heard this, the householder Anāthapiṇḍada surged with joy.

source: དགེ་སློང་དེ་ག་ལ་འདུག་པ་དེར་སོང་སྟེ་ཕྱིན་ནས་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ་སྨྲས་པ།
en: He went to see the monk, bowed down at his feet, and said,

source: ཁྱོད་རབ་ཏུ་བྱུང་བས་བདག་ཟིལ་གྱིས་ནོན་པར་གྱུར་ཏོ། །
en: “By going forth you have outshone me.

source: ད་བདག་གིས་ཁྱོད་ཇི་སྲིད་འཚོའི་བར་དུ་གོས་དང་། ཟས་དང་མལ་ཆ་དང་སྟན་དང་ནད་གསོས་དང་། སྨན་ཟོང་རྣམས་ཅི་བཞེད་པ་བསྟབ་པར་བགྱིའོ་ཞེས་བྱས་སོ། །
en: For as long as I live, I shall serve you with provisions of clothing, food, bedding, a seat, and medicines for the sick—whatever you need.”
